// 서울랜드 메인페이지 JS - main.js ///////////

// 제이쿼리 코드블록 ///////////////////////
$(function(){ // jQB /////////////////////

    // 1. 메인배너 기능구현 ////////
    // 대상: 슬라이드박스 .slide li
    var sld = $(".slide li");
    // 슬라이드 순번변수
    var snum = 0;

    // 1-1. 오른쪽 버튼 클릭시 다음배너 나오기
    // 대상: .rb
    $(".rb").click(function(){
        // 확인
        console.log("오른쪽이동!");

        // 슬라이드 순번증가 //////////////////////////
        snum++;
        if(snum === sld.length) snum = 0;
        // 한계수체크: 슬라이드 개수와 같아지면 처음으로!
        console.log("슬라이드개수:"+sld.length);
        console.log("슬라이드번호:"+snum);

        // 1. 다음순번 li 슬라이드에 클래스 "on"넣기


    }); /////////// click /////////////////




}); //////////// jQB /////////////////////
//////////////////////////////////////////